Repository: ghost4tech/yaxii-woocommerce-shipping-importer
Catalog: languages/yaxii-wc-importer-*.po
Languages: ar, fr_fr

source: WooCommerce to Yaxii Importer
ar: أداة استيراد الشحن من ووكومرس إلى ياكسي
fr_fr: Importateur WooCommerce vers Yaxii

source: WC Importer
ar: استيراد WC
fr_fr: Importateur WC

source: Migrate WooCommerce shipping zones and costs to Yaxii Smart Form Shipping Manager. Simple, fast, and free for Yaxii Smart Form license holders.
ar: انقل مناطق وتكاليف الشحن من ووكومرس إلى مدير الشحن في ياكسي سمارت فورم. بسيط وسريع ومجاني لأصحاب رخصة ياكسي سمارت فورم.
fr_fr: Migrez les zones et les coûts d'expédition WooCommerce vers le gestionnaire d'expédition Yaxii Smart Form. Simple, rapide et gratuit pour les détenteurs de licence Yaxii Smart Form.

source: WordPress 5.8 or higher is required. You are running version %s.
ar: مطلوب ووردبريس 5.8 أو أعلى. أنت تستخدم الإصدار %s.
fr_fr: WordPress 5.8 ou supérieur est requis. Vous utilisez la version %s.

source: PHP 7.4 or higher is required. You are running version %s.
ar: مطلوب PHP 7.4 أو أعلى. أنت تستخدم الإصدار %s.
fr_fr: PHP 7.4 ou supérieur est requis. Vous utilisez la version %s.

source: WooCommerce plugin is required. Please install and activate WooCommerce.
ar: إضافة ووكومرس مطلوبة. يرجى تثبيت وتفعيل ووكومرس.
fr_fr: Le plugin WooCommerce est requis. Veuillez installer et activer WooCommerce.

source: WooCommerce 5.0 or higher is required. You are running version %s.
ar: مطلوب ووكومرس 5.0 أو أعلى. أنت تستخدم الإصدار %s.
fr_fr: WooCommerce 5.0 ou supérieur est requis. Vous utilisez la version %s.

source: Yaxii Smart Form plugin is required. Please install and activate Yaxii Smart Form.
ar: إضافة ياكسي سمارت فورم مطلوبة. يرجى تثبيت وتفعيل ياكسي سمارت فورم.
fr_fr: Le plugin Yaxii Smart Form est requis. Veuillez installer et activer Yaxii Smart Form.

source: Yaxii Smart Form Shipping Manager is not available. Please update Yaxii Smart Form to the latest version.
ar: مدير الشحن في ياكسي سمارت فورم غير متوفر. يرجى تحديث ياكسي سمارت فورم إلى أحدث إصدار.
fr_fr: Le gestionnaire d'expédition Yaxii Smart Form n'est pas disponible. Veuillez mettre à jour Yaxii Smart Form vers la dernière version.

source: Yaxii Smart Form license validation function not found.
ar: وظيفة التحقق من رخصة ياكسي سمارت فورم غير موجودة.
fr_fr: Fonction de validation de licence Yaxii Smart Form introuvable.

source: A valid Yaxii Smart Form license is required to use this importer. Please activate your license.
ar: رخصة ياكسي سمارت فورم صالحة مطلوبة لاستخدام هذه الأداة. يرجى تفعيل رخصتك.
fr_fr: Une licence Yaxii Smart Form valide est requise pour utiliser cet importateur. Veuillez activer votre licence.

source: Security check failed
ar: فشل التحقق الأمني
fr_fr: Échec de la vérification de sécurité

source: Insufficient permissions
ar: صلاحيات غير كافية
fr_fr: Permissions insuffisantes

source: Migration Wizard
ar: معالج الاستيراد
fr_fr: Assistant de migration

source: Import your WooCommerce shipping zones and costs to Yaxii Smart Form Shipping Manager. Simple, fast, and safe.
ar: استورد مناطق وتكاليف الشحن من ووكومرس إلى مدير الشحن في ياكسي سمارت فورم. بسيط وسريع وآمن.
fr_fr: Importez vos zones et coûts d'expédition WooCommerce dans le gestionnaire d'expédition Yaxii Smart Form. Simple, rapide et sûr.

source: Scan
ar: فحص
fr_fr: Scanner

source: Map Methods
ar: ربط الطرق
fr_fr: Mapper les méthodes

source: Import
ar: استيراد
fr_fr: Importer

source: Complete
ar: اكتمال
fr_fr: Terminer

source: Step 1: Scan WooCommerce Data
ar: الخطوة 1: فحص بيانات ووكومرس
fr_fr: Étape 1 : Scanner les données WooCommerce

source: Click the button below to scan your WooCommerce shipping zones and methods.
ar: انقر على الزر أدناه لفحص مناطق وطرق الشحن في ووكومرس.
fr_fr: Cliquez sur le bouton ci-dessous pour scanner vos zones et méthodes d'expédition WooCommerce.

source: Scan WooCommerce Data
ar: فحص بيانات ووكومرس
fr_fr: Scanner les données WooCommerce

source: Zones Found
ar: المناطق الموجودة
fr_fr: Zones trouvées

source: Shipping Methods
ar: طرق الشحن
fr_fr: Méthodes d'expédition

source: States Covered
ar: الولايات المغطاة
fr_fr: États couverts

source: Continue to Method Mapping
ar: المتابعة إلى ربط الطرق
fr_fr: Continuer vers le mappage des méthodes

source: Step 2: Map Shipping Methods
ar: الخطوة 2: ربط طرق الشحن
fr_fr: Étape 2 : Mapper les méthodes d'expédition

source: Map your WooCommerce shipping methods to Yaxii Smart Form methods.
ar: اربط طرق الشحن في ووكومرس بطرق ياكسي سمارت فورم.
fr_fr: Mappez vos méthodes d'expédition WooCommerce aux méthodes Yaxii Smart Form.

source: Method Mapping
ar: ربط الطرق
fr_fr: Mappage des méthodes

source: Back
ar: رجوع
fr_fr: Retour

source: Continue to Import
ar: المتابعة إلى الاستيراد
fr_fr: Continuer vers l'importation

source: Step 3: Import Settings
ar: الخطوة 3: إعدادات الاستيراد
fr_fr: Étape 3 : Paramètres d'importation

source: Choose how to handle existing Yaxii shipping costs.
ar: اختر كيفية التعامل مع تكاليف الشحن الموجودة في ياكسي.
fr_fr: Choisissez comment gérer les coûts d'expédition Yaxii existants.

source: Conflict Resolution Strategy:
ar: استراتيجية حل التعارض:
fr_fr: Stratégie de résolution des conflits :

source: Overwrite
ar: استبدال
fr_fr: Écraser

source: Replace all existing prices with WooCommerce data
ar: استبدال جميع الأسعار الموجودة ببيانات ووكومرس
fr_fr: Remplacer tous les prix existants par les données WooCommerce

source: Skip Existing
ar: تخطي الموجود
fr_fr: Ignorer l'existant

source: Only import states that don't have prices yet
ar: استيراد الولايات التي لا تحتوي على أسعار فقط
fr_fr: Importer uniquement les états qui n'ont pas encore de prix

source: Keep Lower Prices
ar: الاحتفاظ بالأسعار الأقل
fr_fr: Conserver les prix les plus bas

source: Use the lower price between existing and WooCommerce
ar: استخدام السعر الأقل بين الموجود وووكومرس
fr_fr: Utiliser le prix le plus bas entre l'existant et WooCommerce

source: Keep Higher Prices
ar: الاحتفاظ بالأسعار الأعلى
fr_fr: Conserver les prix les plus élevés

source: Use the higher price between existing and WooCommerce
ar: استخدام السعر الأعلى بين الموجود وووكومرس
fr_fr: Utiliser le prix le plus élevé entre l'existant et WooCommerce

source: Create Backup Before Import
ar: إنشاء نسخة احتياطية قبل الاستيراد
fr_fr: Créer une sauvegarde avant l'importation

source: Recommended: Create a backup that you can restore if needed
ar: موصى به: إنشاء نسخة احتياطية يمكنك استعادتها عند الحاجة
fr_fr: Recommandé : Créer une sauvegarde que vous pourrez restaurer si nécessaire

source: Important:
ar: هام:

source: This will modify your Yaxii Smart Form shipping costs. A backup will be created automatically.
ar: سيؤدي هذا إلى تعديل تكاليف الشحن في ياكسي سمارت فورم. سيتم إنشاء نسخة احتياطية تلقائياً.
fr_fr: Cela modifiera vos coûts d'expédition Yaxii Smart Form. Une sauvegarde sera créée automatiquement.

source: Start Import
ar: بدء الاستيراد
fr_fr: Démarrer l'importation

source: Import Completed Successfully!
ar: اكتمل الاستيراد بنجاح!
fr_fr: Importation terminée avec succès !

source: Go to Yaxii Shipping Manager
ar: الذهاب إلى مدير الشحن في ياكسي
fr_fr: Aller au gestionnaire d'expédition Yaxii

source: Import Again
ar: استيراد مرة أخرى
fr_fr: Importer à nouveau

source: Export to CSV
ar: تصدير إلى CSV
fr_fr: Exporter en CSV

source: Processing...
ar: جارٍ المعالجة...
fr_fr: Traitement en cours...

source: Backup Manager
ar: مدير النسخ الاحتياطية
fr_fr: Gestionnaire de sauvegardes

source: Manage your Yaxii shipping data backups.
ar: إدارة النسخ الاحتياطية لبيانات الشحن في ياكسي.
fr_fr: Gérez vos sauvegardes de données d'expédition Yaxii.

source: Create Backup Now
ar: إنشاء نسخة احتياطية الآن
fr_fr: Créer une sauvegarde maintenant

source: Refresh List
ar: تحديث القائمة
fr_fr: Actualiser la liste

source: Click refresh to load backups list.
ar: انقر على تحديث لتحميل قائمة النسخ الاحتياطية.
fr_fr: Cliquez sur actualiser pour charger la liste des sauvegardes.

source: Scanning WooCommerce data...
ar: جارٍ فحص بيانات ووكومرس...
fr_fr: Analyse des données WooCommerce...

source: Importing data...
ar: جارٍ استيراد البيانات...
fr_fr: Importation des données...

source: Success!
ar: نجح!
fr_fr: Succès !

source: Error
ar: خطأ
fr_fr: Erreur

source: Are you sure you want to import? This will modify your Yaxii shipping costs.
ar: هل أنت متأكد من الاستيراد؟ سيؤدي هذا إلى تعديل تكاليف الشحن في ياكسي.
fr_fr: Êtes-vous sûr de vouloir importer ? Cela modifiera vos coûts d'expédition Yaxii.

source: Are you sure you want to restore from backup?
ar: هل أنت متأكد من استعادة النسخة الاحتياطية؟
fr_fr: Êtes-vous sûr de vouloir restaurer depuis la sauvegarde ?

source: Home Delivery - التوصيل للمنزل
ar: التوصيل للمنزل
fr_fr: Livraison à domicile

source: Office Delivery - التوصيل للمكتب
ar: التوصيل للمكتب
fr_fr: Livraison au bureau

source: Invalid data format
ar: تنسيق بيانات غير صالح
fr_fr: Format de données invalide

source: Failed to import data
ar: فشل استيراد البيانات
fr_fr: Échec de l'importation des données

source: Invalid state data for: %s
ar: بيانات ولاية غير صالحة لـ: %s
fr_fr: Données d'état invalides pour : %s

source: Missing required fields for state: %s
ar: حقول مطلوبة مفقودة للولاية: %s
fr_fr: Champs requis manquants pour l'état : %s

source: Invalid costs format for state: %s
ar: تنسيق تكاليف غير صالح للولاية: %s
fr_fr: Format de coûts invalide pour l'état : %s

source: No data to backup
ar: لا توجد بيانات للنسخ الاحتياطي
fr_fr: Aucune donnée à sauvegarder

source: Failed to create backup
ar: فشل إنشاء النسخة الاحتياطية
fr_fr: Échec de la création de la sauvegarde

source: Backup not found
ar: لم يتم العثور على النسخة الاحتياطية
fr_fr: Sauvegarde introuvable

source: Failed to restore backup
ar: فشل استعادة النسخة الاحتياطية
fr_fr: Échec de la restauration de la sauvegarde

source: Import completed successfully!
ar: اكتمل الاستيراد بنجاح!
fr_fr: Importation terminée avec succès !

source: Backup created successfully
ar: تم إنشاء النسخة الاحتياطية بنجاح
fr_fr: Sauvegarde créée avec succès

source: Backup ID is required
ar: معرف النسخة الاحتياطية مطلوب
fr_fr: L'ID de sauvegarde est requis

source: Backup restored successfully
ar: تم استعادة النسخة الاحتياطية بنجاح
fr_fr: Sauvegarde restaurée avec succès

source: Yaxii WC Importer
ar: أداة استيراد ياكسي
fr_fr: Importateur Yaxii WC

source: WooCommerce Shipping Importer
ar: أداة استيراد الشحن من ووكومرس
fr_fr: Importateur d'expédition WooCommerce

source: Need Yaxii Smart Form?
ar: هل تحتاج ياكسي سمارت فورم؟
fr_fr: Besoin de Yaxii Smart Form ?

source: Get the most powerful form plugin for WooCommerce
ar: احصل على أقوى إضافة نماذج لووكومرس
fr_fr: Obtenez le plugin de formulaires le plus puissant pour WooCommerce

source: Learn More
ar: معرفة المزيد
fr_fr: En savoir plus

source: Invalid or expired license. Please activate your Yaxii Smart Form license.
ar: رخصة غير صالحة أو منتهية الصلاحية. يرجى تفعيل رخصة ياكسي سمارت فورم.
fr_fr: Licence invalide ou expirée. Veuillez activer votre licence Yaxii Smart Form.

source: Yaxii Smart Form core plugin not properly installed.
ar: إضافة ياكسي سمارت فورم الأساسية غير مثبتة بشكل صحيح.
fr_fr: Le plugin principal Yaxii Smart Form n'est pas correctement installé.

source: Yaxii Smart Form license could not be verified. Please reactivate your license.
ar: لا يمكن التحقق من رخصة ياكسي سمارت فورم. يرجى إعادة تفعيل رخصتك.
fr_fr: La licence Yaxii Smart Form n'a pas pu être vérifiée. Veuillez réactiver votre licence.

source: A valid Yaxii Smart Form license is required to use this importer. Please activate your license at:
ar: رخصة ياكسي سمارت فورم صالحة مطلوبة لاستخدام هذه الأداة. يرجى تفعيل رخصتك على:
fr_fr: Une licence Yaxii Smart Form valide est requise pour utiliser cet importateur. Veuillez activer votre licence sur :

source: Get Yaxii Smart Form
ar: احصل على ياكسي سمارت فورم
fr_fr: Obtenir Yaxii Smart Form

source: Yaxii WC Importer:
ar: أداة استيراد ياكسي:
fr_fr: Importateur Yaxii WC :

source: Your Yaxii Smart Form license could not be verified. Please reactivate your license.
ar: لا يمكن التحقق من رخصة ياكسي سمارت فورم الخاصة بك. يرجى إعادة تفعيل رخصتك.
fr_fr: Votre licence Yaxii Smart Form n'a pas pu être vérifiée. Veuillez réactiver votre licence.

source: No data to import
ar: لا توجد بيانات للاستيراد
fr_fr: Aucune donnée à importer

source: Failed to import data. Please check WordPress debug log for details.
ar: فشل استيراد البيانات. يرجى التحقق من سجل تصحيح الأخطاء في ووردبريس للحصول على التفاصيل.
fr_fr: Échec de l'importation des données. Veuillez consulter le journal de débogage WordPress pour plus de détails.

source: Import appeared to succeed but data verification failed. Please try again.
ar: يبدو أن الاستيراد نجح ولكن التحقق من البيانات فشل. يرجى المحاولة مرة أخرى.
fr_fr: L'importation semble avoir réussi mais la vérification des données a échoué. Veuillez réessayer.

source: Data must be an array
ar: يجب أن تكون البيانات عبارة عن مصفوفة
fr_fr: Les données doivent être un tableau

source: Data array is empty
ar: مصفوفة البيانات فارغة
fr_fr: Le tableau de données est vide

source: Missing "enabled" field for state: %s
ar: حقل "enabled" مفقود للولاية: %s
fr_fr: Champ "enabled" manquant pour l'état : %s

source: Missing "costs" field for state: %s
ar: حقل "costs" مفقود للولاية: %s
fr_fr: Champ "costs" manquant pour l'état : %s
